Autodesk.Revit.DB.Analysis.FieldDomainPointsByXYZ.#ctor(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ})
Creates object from an array of three-dimensional point coordinates
points:
Array of three-dimensional point coordinates representing domain points
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied array points contain too many members (over 1000)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011